/*******************************************************************************

                                UI之页面管理
本模块负责管理页面(主界面)名称，总页，当前页管理
本模块独立于应用及UI
********************************************************************************/
#ifndef _UI_PAGE_H
#define _UI_PAGE_H

/*******************************************************************************
                                  相关结构
********************************************************************************/

//----------------------------------主结构--------------------------------------
#include "Color.h"
struct _UiPage{
  unsigned short Cur;       //当前页或当前页数据起始
  unsigned short Count;     //总页或总数
  const char *pName;        //页名
};

extern struct _UiPage UiPage; //直接静态定义
/******************************************************************************
                                  相关函数
*******************************************************************************/

//---------------------------------初始化函数-----------------------------------
void UiPage_Init(void);

//---------------------------------刷新函数-----------------------------------
void UiPage_Refresh(void);

//---------------------------------更新本页名称--------------------------------
void UiPage_UpdateName(const char *pName);

//---------------------------------更新为无页码-----------------------------
//即只有一页，不面要显示页码
void UiPage_UpdateNoPage(void);

//---------------------------------更新为位置-------------------------------
void UiPage_UpdatePos(unsigned short Cur,        //当页起始位置
                      unsigned short Count);      //总行

//--------------------------------更新为页信息----------------------------------
void UiPage_UpdatePage(unsigned short Start,       //当页起始行
                       unsigned short Count,      //总行
                       unsigned char PageLine);    //每页行数

/******************************************************************************
                               回调函数
*******************************************************************************/

//--------------------------------更新通报-----------------------------------
void UiPage_cbUpdateUi(unsigned char Mask); //0b页更新,1b名称更新

#endif //#define _UI_STATE_H




