/******************************************************************************

                          GB2312字库模块接口
仅定义标准接口，实现方式，是否支持等由实现决定。
******************************************************************************/
#ifndef __GB2312ZM_H
#define __GB2312ZM_H
#ifdef SUPPORT_EX_PREINCLUDE//不支持Preinlude時
  #include "Preinclude.h"
#endif

/*****************************************************************************
                               相关函数
具体是否实现，支持情况由应用决定
******************************************************************************/

//--------------------------------获得英文字模-----------------------------
const unsigned char *GB2312ZM_pGetAsc(char Asc);

//--------------------------------获得中文字模-----------------------------
const unsigned char *GB2312ZM_pGetHZ(unsigned short GB2312);

//--------------------------------获得英文8*8字模--------------------------
const unsigned char *GB2312ZM_pGetAsc8(char Asc);

//--------------------------------获得英文5*7字模--------------------------
const unsigned char *GB2312ZM_pGetAsc57(char Asc);

//----------------------------------扩展字模-------------------------------
//支持用户字模时，需实现：
#ifdef SUPPORT_USER_ZM
  #include "GB2312ZM_EX.h"
#endif  

//-----------------------------获得英文10*20字模---------------------------
const unsigned char *GB2312ZM_pGetAsc20(char Asc);

/*****************************************************************************
                               相关回调函数
******************************************************************************/
 
//-------------------------由相对位置得到字模------------------------------------
//有几下几种实现方式:
//1. 定义有基址时,表示在内部Flash里固化：直接访问
#ifdef GB2312ZM_BASE   
#define GB2312ZM_pGetZM(base,len) ((const unsigned char *)GB2312ZM_BASE + base)
//2. //定义为程序内部时，直接指向转换
#elif GB2312ZM_INNER  
  extern const unsigned char GB2312_ZM[];
#define  GB2312ZM_pGetZM(base,len) (&GB2312_ZM[base])
//3. 字库芯片或外部Flash里，需实现缓冲:
#else
  const unsigned char *GB2312ZM_pGetZM(unsigned long Base, unsigned char Len);      
#endif
    
    
#endif //#define __GB2312ZM_H
 












