/*******************************************************************************

                    PNG格式解码实现
此模块只支持单线程操作
********************************************************************************/
#ifndef _DECODER_PNG_H
#define _DECODER_PNG_H
#ifdef SUPPORT_EX_PREINCLUDE//不支持Preinlude時
  #include "Preinclude.h"
#endif

/*******************************************************************************
                             相关说明及常量定义
********************************************************************************/

//系统用到的，最大图宽的宽度，用于内部定义输出数据缓冲区,值越大越占内存
#ifndef DECODER_PNG_W_MAX 
  #define DECODER_PNG_BUF_SIZE         480
#endif

//用到的PNG图片压缩前向查找表最大距离，与PNG图片宽度及PNG压缩深有关,值越大越占内存
#ifndef DECODER_PNG_RESERVED_SPACE
  #define DECODER_PNG_RESERVED_SPACE   512
#endif


/*******************************************************************************
                              相关函数
********************************************************************************/

//-----------------------------PNG译码器实现-----------------------------------
//暂仅支持索引色,逐行扫，默认压缩方式与自动滤波器格式
signed char DecodePNG(unsigned char bbp,//色深,1,2,4,8,只仅支持索引色
                        unsigned short w, //图像宽度
                        unsigned short h,  //图像高度
                        const unsigned char *idat,//idat区域的压缩数据
                        unsigned long idatLen);    //idat区域数据长度

/*******************************************************************************
                              回调函数
********************************************************************************/

//---------------------------保存或绘制第n行数据---------------------------------
//此行数在DecodePNG()中调用,以保存或或绘制一行图像
void DecodePNG_cbOutLine(const unsigned char *data, //索引色或真实色
                          unsigned short Line);        //需要绘制的行,1开始


#endif //_DECODER_PNG_H


