/*****************************************************************************

//		        按键模块私有部分-在使用QTGUI时的实现
//QTGUI固定支持4个按键,键值需转换为QGUI支持的格式
****************************************************************************/

#include "Key.h"
#include "MenuMng.h"
#include "GUI.h"

/*******************************************************************************
					                    回调函数实现
*******************************************************************************/
//------------------------判断当前保持按键是否为加速键------------------------
//SUPPORT_KEY_ACCELERATE时需实现,一般将上下键设置为加速键
unsigned char Key_cbIsAccelarateKey(KeySize_t Key)
{
  if(Key == MENU_MNG_KEY_UP)   return 1;
  if(Key == MENU_MNG_KEY_DOWN) return 1;
  return 0;  
}

//-------------------------------短按键通报函数---------------------------------
//用回调的方式实现按键处理
void Key_cbShortNotify(KeySize_t Key)
{
  GUI_Key(MENU_MNG_KEY_SHORT | Key);
}

//-------------------------------长按键通报函数---------------------------------
//不支持时可实现为空
void Key_cbLongNotify(KeySize_t Key)
{
  GUI_Key(MENU_MNG_KEY_LONG | Key);
}

//-------------------------------保持按键通报函数------------------------------
//不支持时可实现为空
void Key_cbKeepNotify(KeySize_t Key)
{
  GUI_Key(MENU_MNG_KEY_KEEP | Key);  
}
