/*******************************************************************************

                    TFT MCU接口驱动-使用TypeB 16位并口时实现
此接口与具体使用显示屏控制器无关
********************************************************************************/

#include "TftDbi.h"

//--------------------------------硬件初始化函数------------------------------
void TftDbi_HwInit(void)
{
  
}

//---------------------------------写指令函数----------------------------------
//指令固定为1个Byte
void TftDbi_WrCmd(unsigned char Cmd)
{
  
  //最后复位结构
  TftDbi.LastCmd = Cmd;
  TftDbi.Timer = TFT_DRV_TIM_OV;  
}

//------------------------------------写数据函数-------------------------------
void TftDbi_WrData(unsigned char Data)
{

}

//------------------------------------读数据函数-------------------------------
//注意大多数指令读出的首个数据为无效值
unsigned char TftDbi_RdData(void)
{
  return 0;  
}

//-----------------------------------写颜色函数--------------------------------
void TftDbi_WrColor(Color_t Color)
{
  
}

//-----------------------------------读颜色函数--------------------------------
Color_t TftDbi_RdColor(void)
{
  return 0; 
}


