/*******************************************************************************

                         TFT DBI操作统一接口
此接口为函数接口，底层需为根据具体DBI口如并口, SPI等
********************************************************************************/
#ifndef _TFT_DBI_H
#define _TFT_DBI_H

/*******************************************************************************
                                  相关配置
********************************************************************************/

#ifndef TFT_DRV_H_PIXEl//水平像素点数
  #define TFT_DRV_H_PIXEl    320     //竖屏时
#endif

#ifndef TFT_DRV_V_PIXEl//垂直像素点数
  #define TFT_DRV_V_PIXEl    480      //竖屏时
#endif

/*******************************************************************************
                                  相关结构
********************************************************************************/
#include "Color.h"

struct _TftDbi{
  unsigned char LastCmd; //缓冲最后写入的命令
  unsigned char Timer;   //定时器
};

extern struct _TftDbi TftDbi; //直接单例化


/*******************************************************************************
                                  相关函数
********************************************************************************/

//---------------------------------初始化函数-----------------------------------
void TftDbi_Init(void);

//---------------------------------任务函数-----------------------------------
//放快速进程中扫描
void TftDbi_Task(void);

//---------------------------------写指令函数-----------------------------------
//指令固定为1个Byte
void TftDbi_WrCmd(unsigned char Cmd);

//---------------------------------写U8数据函数-------------------------------
void TftDbi_WrDataC(unsigned char Data);

//---------------------------------读U8数据函数-------------------------------
unsigned char TftDbi_RdDataC(void);

//---------------------------------写U16数据函数-------------------------------
void TftDbi_WrDataS(unsigned short Data);

//---------------------------------读U16数据函数-------------------------------
unsigned short TftDbi_RdDataS(void);

//---------------------------------写颜色函数-------------------------------
void TftDbi_WrColor(Color_t Color);

//---------------------------------读颜色函数-------------------------------
Color_t TftDbi_RdColor(void);

/*******************************************************************************
                                 回调函数
********************************************************************************/

//----------------------得到用户颜色查找表----------------------------------
#if defined(SUPPORT_COLOR_RGB666) || defined(SUPPORT_COLOR_INDEX)
  const unsigned long *TftDrv_pcbGetUserCLut(void); //表
  unsigned char TftDrv_cbGetUserCLutSize(void); //表大小,< (255 - COLOR_COUNT)
#endif

#endif //#define _TFT_DRV_H




