/*******************************************************************************

                     TFT DBI操作统一接口-035显示屏相关函数实现
此接口与具体使用显示屏控制器无关
********************************************************************************/
#include "TftDbi.h"
#include "TftCmd_035.h"

/*******************************************************************************
                                  相关函数-普通函数实现
********************************************************************************/
//---------------------------------初始化函数-----------------------------------
void TftDbi_Init(void)
{
  TftDbi.Timer = 0;
  TftDbi_HwInit();
  //035显示屏初始化
  
  
  
  
  //清屏不亮后开显
}

//---------------------------------任务函数-----------------------------------
//放16ms进程中扫描
void TftDbi_Task(void)
{
  if(!TftDbi.Timer) return;
  TftDbi.Timer--;
  if(TftDbi.Timer) return;   
  //内存读写时，强制封闭指令
  if((TftDbi.LastCmd == TFT_CMD_RD_RAM) || (TftDbi.LastCmd == TFT_CMD_WR_RAM))  
    TftDbi_WrCmd(TFT_CMD_WR_NOP);
}


