/*******************************************************************************
                        绘图库标准接口-底层操作函数接口
通过此接口使Plot模块独立于度层显示屏硬件实现
********************************************************************************/
#ifndef _PLOT_CB_HW_H
#define _PLOT_CB_HW_H

/*******************************************************************************
                              外部显存实现
********************************************************************************/
#ifdef SUPPORT_EX_VFB    //外部显存实现




/*******************************************************************************
                        默认使用内部显存实现
********************************************************************************/
#else  //
#include "TftDrv.h"  //显示缓冲区

//---------------------------绝对定位某个位置与区域函数-------------------------
//这里返回显示地址位置以便下次使用
//Color_t * Plot_cbAbsLocalArea(u16 x, u16 y, U16 w, U16 h);
#define Plot_cbAbsLocalArea(xX, yY, wW, hH)  (&TftDrv_Buf[yY][xX]) 

//---------------------------绝对定位某个位置与区域函数-------------------------
//这里返回显示地址位置以便下次使用
//Color_t * Plot_cbAbsLocalArea(u16 x, u16 y, U16 w, U16 h);
#define Plot_cbAbsLocalArea(xX, yY, wW, hH)  (&TftDrv_Buf[yY][xX])  

//---------------------------相对定位函数-------------------------------------
//返回显示地址位置以便下次使用
void Plot_cbRlyLocal(Color_t *pColor, u16 RelativePos);
#define Plot_cbRlyLocal(pcolor, rp)  ((pcolor) + (rp))  

//----------------------------设置当前位置颜色--------------------------------
//同时指下一需写入的位置
//void Plot_cbSetCurColor(Color_t *pColor, Color_t Color);
#define Plot_cbSetCurColor(pcolor, cc)  do{*(pcolor) = cc; (pcolor)++; }while(0)

//----------------------------更新至下一位置--------------------------------
//不写入颜色，仅将下次写入位置移至下一个点
//void Plot_cbUpdateNext(Color_t *pColor);
#define Plot_cbUpdateNext(pcolor)  do{(pcolor)++; }while(0) //这里不用


#endif 
#endif //_PLOT_CB_HW_H


