/*******************************************************************************

                          Plot绘制常用图标功能实现

*******************************************************************************/

#include "Plot.h"
#include "Color.h"

/*******************************************************************************
                                 相关函数
*******************************************************************************/

//-------------------------------绘制电池状态----------------------------------
//占4个字符宽度2字符高度
void PlotIcon_Bat(unsigned char Level,  //电量级别:0-4,0
                  unsigned short x,     //x坐标
                  unsigned short y)    //y坐标
{
  //图标绘制为: 从2，1坐标开始局中，高度14,电量宽24高14，正极宽4高8
  Plot_FullRect(x, y, 32, 16); //先清背景
  Color_t brushColor = PlotPalette.brushColor; //缓冲以还原
  Plot_SetBrushColor(Plot_GetPenColor()); //填充有效矩形有前景色
  Plot_FullRect(x + (2 + 24), y + 4, 4, 8); //填充右侧正极符号
  //填充电量
  if(Level >= 4){//电量满
    Plot_FullRect(x + 2, y + 1, 24, 14);
  }
  else{//电量不满
    Plot_Rect(x + 2, y + 1, 24, 14);//绘制电池外框
    if(Level){//非空时,填充电量级
      Plot_FullRect(x + 3, y + 2, Level * 6, 13);
    }
  }
  Plot_SetBrushColor(brushColor); //还原背景色  
}
