/***************************************************************************

       扩展输出8位(Extend Output 8Bit)接口-指示灯实现

***************************************************************************/
#include "EO8Light.h"

/***************************************************************************
                              相关函数实现
***************************************************************************/


//--------------------------------是否打开--------------------------------
unsigned char EO8Light_IsOn(unsigned char Mask)
{
  return EO8Light_cbIsOn(Mask);
}

//-------------------------------开关操作---------------------------------
void EO8Light_On(unsigned char Mask)
{
  EO8Light_cbOn(Mask);
}
void EO8Light_Off(unsigned char Mask)
{
  EO8Light_cbOff(Mask);  
}


