/***************************************************************************

           扩展输出8位(Extend Output 8Bit)接口-指示灯
此模块负责将指示灯亮灭，通过托管芯片输出(如：指示灯接口)
此模块仅用于优化代码，以防止直接宏操作底层时代码过多。
***************************************************************************/
#ifndef __EO8_LIGHT_H
#define __EO8_LIGHT_H
#ifdef SUPPORT_EX_PREINCLUDE//不支持Preinlude時
  #include "Preinclude.h"
#endif
#include "IoCtrl.h" //需实现真实操作

/***************************************************************************
                              相关函数
***************************************************************************/

//---------------------------------初始化函数------------------------------
#define EO8Light_Init()  (Light_Cfg())

//--------------------------------是否打开--------------------------------
unsigned char EO8Light_IsOn(unsigned char Mask);

//-------------------------------开关操作---------------------------------
void EO8Light_On(unsigned char Mask);
void EO8Light_Off(unsigned char Mask);

/***************************************************************************
                              回调函数
***************************************************************************/

//------------------------------判断位输出--------------------------------
#define EO8Light_cbIsOn(mask)  (Light_IsOn(mask))

//--------------------------------位输出操作---------------------------------
#define EO8Light_cbOn(mask)  do{Light_On(mask); }while(0)
#define EO8Light_cbOff(mask) do{Light_Off(mask); }while(0)

#endif //#define __EO8_LIGHT_H

